
## Plan Result

[CI link](https://github.com/goda6565/portfolio/actions/runs/15128749024)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger
* Replace
  * module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection
  * module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection must be replaced
-/+ resource "google_cloudbuildv2_connection" "github_connection" {
      - annotations           = {} -> null
      ~ create_time           = "2025-05-19T00:49:28.210981729Z" -> (known after apply)
      - disabled              = false -> null
      ~ effective_annotations = {} -> (known after apply)
      ~ etag                  = "R4KnHWzIguFPDyjrfxU4Ki59tvk9XqmxFIeXnCXC1uM" -> (known after apply)
      ~ id                    = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection" -> (known after apply)
      ~ installation_state    = [
          - {
              - stage      = "COMPLETE"
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ location              = "asia-northeast1" -> "us-west2" # forces replacement
        name                  = "github-connection"
      ~ reconciling           = false -> (known after apply)
      ~ update_time           = "2025-05-19T00:49:29.586403361Z" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ github_config {
            # (1 unchanged attribute hidden)

          ~ authorizer_credential {
              + username                   = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository must be replaced
-/+ resource "google_cloudbuildv2_repository" "github_repository" {
      - annotations           = {} -> null
      ~ create_time           = "2025-05-20T04:10:51.600982402Z" -> (known after apply)
      ~ effective_annotations = {} -> (known after apply)
      ~ etag                  = "WUDdtaJ0GWwVYYZlWml2gmOP9lhDa8ToSCU54LULrRg" -> (known after apply)
      ~ id                    = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection/repositories/portfolio" -> (known after apply)
      ~ location              = "asia-northeast1" -> (known after apply)
        name                  = "portfolio"
      ~ parent_connection     = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection" -> (known after apply) # forces replacement
      ~ update_time           = "2025-05-20T04:10:53.074094822Z" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger will be created
  + resource "google_cloudbuild_trigger" "github_trigger" {
      + create_time        = (known after apply)
      + description        = "Build trigger for frontend"
      + filename           = "manifests/cloudbuild/frontend.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "apps/frontend/**",
        ]
      + location           = "us-west2"
      + name               = "frontend-trigger"
      + project            = "portfolio-460206"
      + service_account    = "projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + trigger_id         = (known after apply)

      + approval_config (known after apply)

      + github {
          + name  = "portfolio"
          + owner = "goda6565"

          + push {
              + branch = "^(main|feat/.*)$"
            }
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

</details>




## :warning: Errors

* add a label destroy: POST https://api.github.com/repos/goda6565/portfolio/issues/28/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":28,"Program":"tfcmt","SHA1":"7683762e58847f47c1b0f858111b7451a2496393","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->